app/controllers/school_classes_controller.rb

  def show
    @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @schoolclass = SchoolClass.create(params.require(:school_class))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-05-22 17:34:20.914446"], ["updated_at", "2017-05-22 17:34:20.914446"]]

  def edit
    @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
	  @schoolclass.update(params.require(:school_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-05-22 17:44:18.817597"], ["id", 1]]